stressTesting/artillery.yml
config:
  target: 'http://localhost:3001'
  phases:
    - duration: 60
      arrivalRate: 100
  processor: "./stressTestFunctions.js"
scenarios:
  - name: "fetch reviews for a restaurant"
    flow:
    - function: generateRestaurantId
    - get:
        url: "/restaurants/{{ restaurantId }}"
    - log: "Sent a request to /restaurants with restaurantId {{ restaurantId }}"